app/controllers/sites_controller.rb

SELECT * FROM "sites"
---
  def index
    @sites = Site.all

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def show
    @site = Site.find(params[:id])

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def edit
    @site = Site.find(params[:id])

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
UPDATE "sites" SET "updated_at" = '2009-09-25 12:21:54.149922', "description" = E'Middle Plantation in present day Williamsburg' WHERE "id" = 1
---
  def update
    @site = Site.find(params[:id])

    respond_to do |format|
      if @site.update_attributes(params[:site])